Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8680.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xDF9"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="BIE0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="BIE0" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDFA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0IE" edc:desc="" edc:mask="0x1" edc:name="RXB0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1IE" edc:desc="" edc:mask="0x1" edc:name="RXB1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0IE" edc:desc="" edc:mask="0x1" edc:name="B0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1IE" edc:desc="" edc:mask="0x1" edc:name="B1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2IE" edc:desc="" edc:mask="0x1" edc:name="B2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3IE" edc:desc="" edc:mask="0x1" edc:name="B3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4IE" edc:desc="" edc:mask="0x1" edc:name="B4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5IE" edc:desc="" edc:mask="0x1" edc:name="B5IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="DRXB0IE" edc:desc="" edc:mask="0x1" edc:name="DRXB0IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DRXB1IE" edc:desc="" edc:mask="0x1" edc:name="DRXB1IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xDFB"/>
        <edc:SFRDef edc:access="---nnn--" edc:cname="TXBIE" edc:desc="" edc:impl="0x1c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuu--" edc:name="TXBIE" edc:nzwidth="0x8" edc:por="---000--" edc:_addr="0xDFC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXB0IE" edc:desc="" edc:mask="0x1" edc:name="TXB0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1IE" edc:desc="" edc:mask="0x1" edc:name="TXB1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2IE" edc:desc="" edc:mask="0x1" edc:name="TXB2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TX0IE" edc:desc="" edc:mask="0x1" edc:name="TX0IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX1IE" edc:desc="" edc:mask="0x1" edc:name="TX1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2IE" edc:desc="" edc:mask="0x1" edc:name="TX2IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xe" edc:beginaddr="0xe00" edc:endaddr="0xf00" edc:regionid="sfr14">
        <edc:AdjustPoint edc:offset="32" edc:_addr="0xE00"/>
        <edc:SFRDef edc:access="nnrrnnnn" edc:cname="B0CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="B0CON" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xE20">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0_TXPRI0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0/TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1_TXPRI1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1/TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2_RTREN" edc:desc="" edc:mask="0x1" edc:name="FILHIT2/RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3_TXREQ" edc:desc="" edc:mask="0x1" edc:name="FILHIT3/TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4_TXERR" edc:desc="" edc:mask="0x1" edc:name="FILHIT4/TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO/TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1_TXABT" edc:desc="" edc:mask="0x1" edc:name="RXM1/TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL_TXBIF" edc:desc="" edc:mask="0x1" edc:name="RXFUL/TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT1" edc:desc="" edc:mask="0x1" edc:name="FILHIT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT2" edc:desc="" edc:mask="0x1" edc:name="FILHIT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT3" edc:desc="" edc:mask="0x1" edc:name="FILHIT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FILHIT4" edc:desc="" edc:mask="0x1" edc:name="FILHIT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRRO" edc:desc="" edc:mask="0x1" edc:name="RTRRO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBIF" edc:desc="" edc:mask="0x1" edc:name="TXBIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="RTRRO_TXLARB" edc:desc="" edc:mask="0x1" edc:name="RTRRO_TXLARB" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B0FILHIT0" edc:desc="" edc:mask="0x1" edc:name="B0FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0FILHIT1" edc:desc="" edc:mask="0x1" edc:name="B0FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0FILHIT2" edc:desc="" edc:mask="0x1" edc:name="B0FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0FILHIT3" edc:desc="" edc:mask="0x1" edc:name="B0FILHIT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0FILHIT4" edc:desc="" edc:mask="0x1" edc:name="B0FILHIT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0RTRRO" edc:desc="" edc:mask="0x1" edc:name="B0RTRRO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0RXM1" edc:desc="" edc:mask="0x1" edc:name="B0RXM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0RXFUL" edc:desc="" edc:mask="0x1" edc:name="B0RXFUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="B0TXPRI0" edc:desc="" edc:mask="0x1" edc:name="B0TXPRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0TXPRI1" edc:desc="" edc:mask="0x1" edc:name="B0TXPRI1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0RTREN" edc:desc="" edc:mask="0x1" edc:name="B0RTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0TXREQ" edc:desc="" edc:mask="0x1" edc:name="B0TXREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0TXERR" edc:desc="" edc:mask="0x1" edc:name="B0TXERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0TXLARB" edc:desc="" edc:mask="0x1" edc:name="B0TXLARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0TXABT" edc:desc="" edc:mask="0x1" edc:name="B0TXABT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0TXB3IF" edc:desc="" edc:mask="0x1" edc:name="B0TXB3IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE21">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B0SID3" edc:desc="" edc:mask="0x1" edc:name="B0SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID4" edc:desc="" edc:mask="0x1" edc:name="B0SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID5" edc:desc="" edc:mask="0x1" edc:name="B0SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID6" edc:desc="" edc:mask="0x1" edc:name="B0SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID7" edc:desc="" edc:mask="0x1" edc:name="B0SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID8" edc:desc="" edc:mask="0x1" edc:name="B0SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID9" edc:desc="" edc:mask="0x1" edc:name="B0SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID10" edc:desc="" edc:mask="0x1" edc:name="B0SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="B0SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="B0SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xE22">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B0EID16" edc:desc="" edc:mask="0x1" edc:name="B0EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID17" edc:desc="" edc:mask="0x1" edc:name="B0EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="B0EXID" edc:desc="" edc:mask="0x1" edc:name="B0EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SRR" edc:desc="" edc:mask="0x1" edc:name="B0SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID0" edc:desc="" edc:mask="0x1" edc:name="B0SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID1" edc:desc="" edc:mask="0x1" edc:name="B0SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0SID2" edc:desc="" edc:mask="0x1" edc:name="B0SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE23">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B0EID8" edc:desc="" edc:mask="0x1" edc:name="B0EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID9" edc:desc="" edc:mask="0x1" edc:name="B0EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID10" edc:desc="" edc:mask="0x1" edc:name="B0EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID11" edc:desc="" edc:mask="0x1" edc:name="B0EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID12" edc:desc="" edc:mask="0x1" edc:name="B0EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID13" edc:desc="" edc:mask="0x1" edc:name="B0EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID14" edc:desc="" edc:mask="0x1" edc:name="B0EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID15" edc:desc="" edc:mask="0x1" edc:name="B0EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE24">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B0EID0" edc:desc="" edc:mask="0x1" edc:name="B0EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID1" edc:desc="" edc:mask="0x1" edc:name="B0EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID2" edc:desc="" edc:mask="0x1" edc:name="B0EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID3" edc:desc="" edc:mask="0x1" edc:name="B0EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID4" edc:desc="" edc:mask="0x1" edc:name="B0EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID5" edc:desc="" edc:mask="0x1" edc:name="B0EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID6" edc:desc="" edc:mask="0x1" edc:name="B0EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0EID7" edc:desc="" edc:mask="0x1" edc:name="B0EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrrnnnn" edc:cname="B0DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="B0DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xE25">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B0DLC0" edc:desc="" edc:mask="0x1" edc:name="B0DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0DLC1" edc:desc="" edc:mask="0x1" edc:name="B0DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0DLC2" edc:desc="" edc:mask="0x1" edc:name="B0DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0DLC3" edc:desc="" edc:mask="0x1" edc:name="B0DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0RB0" edc:desc="" edc:mask="0x1" edc:name="B0RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0RB1" edc:desc="" edc:mask="0x1" edc:name="B0RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B0RXRTR" edc:desc="" edc:mask="0x1" edc:name="B0RXRTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B0D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B0D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE26">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B0D00" edc:desc="" edc:mask="0x1" edc:name="B0D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0D01" edc:desc="" edc:mask="0x1" edc:name="B0D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0D02" edc:desc="" edc:mask="0x1" edc:name="B0D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0D03" edc:desc="" edc:mask="0x1" edc:name="B0D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0D04" edc:desc="" edc:mask="0x1" edc:name="B0D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0D05" edc:desc="" edc:mask="0x1" edc:name="B0D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0D06" edc:desc="" edc:mask="0x1" edc:name="B0D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B0D07" edc:desc="" edc:mask="0x1" edc:name="B0D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
